title: Error Unrecognized Device
description: An error response that indicates a device needs to unenroll.
payload:
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
    visionOS:
      introduced: '1.1'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: code
  type: <string>
  presence: required
  rangelist:
  - com.apple.unrecognized.device
  content: Indicates that the device is not recognized by the server. This causes
    the device to unenroll from MDM.
- key: description
  type: <string>
  presence: optional
  content: A description of the error. Only use this for logging purposes and don't
    display it to the user.
- key: message
  type: <string>
  presence: optional
  content: A description of the error to display to the user.
notes:
- title: ''
  content: |-
    The schema for a JSON or property list XML document that an MDM server's 403 response body contains. The response headers need to include a "Content-Type" header that indicates whether the response returns JSON or XML.

    The MDM server returns this response when it doesn't recognize the device making the request. This causes the device to unenroll from the MDM server. Use this error instead of the server returning a 401 response to cause an unenroll.
