title: Error Code Pairing Token Missing
description: An error response that indicates a missing pairing token.
payload:
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: code
  type: <string>
  presence: required
  rangelist:
  - com.apple.watch.pairing.token.missing
  content: Indicates that the pairing token, which the system requires to enroll the
    watch, is missing.
- key: description
  type: <string>
  presence: optional
  content: A description of the error. Only use this for logging purposes and don't
    display it to the user.
- key: message
  type: <string>
  presence: optional
  content: A description of the error to display to the user.
- key: details
  type: <dictionary>
  presence: required
  content: A dictionary that contains additional data about the error code.
  subkeys:
  - key: security-token
    type: <string>
    presence: required
    content: The security token to pass to the phone's MDM server to create the pairing
      token. This token needs to be a random UUID string.
notes:
- title: ''
  content: |-
    The schema for a JSON or property list XML document that an MDM server's 403 response body contains. The response headers need to include a "Content-Type" header that indicates whether the response returns JSON or XML.

    The system returns this response when an Apple Watch enrolls in MDM, but the watch doesn't include a `PAIRING_TOKEN` in the `MachineInfo` request. After the watch receives this response, it fetches a pairing token from the phone's MDM server through a request to the phone. Then, the watch repeats the enrollment request and includes the pairing token.
