title: Error Well-known Failed
description: An error response that indicates a well-known service discovery request
  failed.
payload:
  supportedOS:
    iOS:
      introduced: '17.5'
    macOS:
      introduced: '14.5'
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '1.2'
    watchOS:
      introduced: n/a
payloadkeys:
- key: code
  type: <string>
  presence: required
  rangelist:
  - com.apple.well-known.failed
  content: Indicates that the well-known request has failed.
- key: description
  type: <string>
  presence: optional
  content: A description of the error. Only use this for logging purposes and don't
    display it to the user.
- key: message
  type: <string>
  presence: optional
  content: A description of the error to display to the user.
notes:
- title: ''
  content: |-
    The schema for a JSON or property list XML document that an MDM server's 403 response body contains. The response headers need to include a "Content-Type" header that indicates whether the response returns JSON or XML.

    The MDM server returns this response to reject a well-known service discovery request from a device made during an account driven enrollment.
