title: Certificate List Command
description: Get a list of installed certificates on a device.
payload:
  requesttype: CertificateList
  supportedOS:
    iOS:
      introduced: '4.0'
      accessrights: AllowInspection
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.7'
      accessrights: AllowInspection
      devicechannel: true
      userchannel: true
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '9.0'
      accessrights: AllowInspection
      supervised: false
    visionOS:
      introduced: '1.1'
      accessrights: AllowInspection
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    watchOS:
      introduced: '10.0'
      accessrights: AllowInspection
      supervised: false
payloadkeys:
- key: ManagedOnly
  supportedOS:
    iOS:
      introduced: '13.0'
    macOS:
      introduced: '10.15'
    tvOS:
      introduced: '13.0'
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, only include certificates that MDM installed or that are in
    the same profile as the MDM payload. User-enrolled devices ignore this value and
    always only include managed certificates. This value is available in iOS 13 and
    later, macOS 10.15 and later, and tvOS 13 and later.
responsekeys:
- key: CertificateList
  type: <array>
  presence: required
  content: An array of certificate list items that describes each certificate.
  subkeys:
  - key: CertificateListItem
    type: <dictionary>
    content: A dictionary that contains information about a certificate list item.
    subkeys:
    - key: CommonName
      type: <string>
      presence: required
      content: The certificate's common name.
    - key: IsIdentity
      type: <boolean>
      presence: required
      content: If `true`, this is an identity certificate.
    - key: Data
      type: <data>
      presence: required
      content: The certificate in DER-encoded X.509 format.
notes:
- title: ''
  content: |-
    This command allows the server to retrieve the list of installed certificates on the device. The command requires that the server has the Inspect Profile Manifest privilege. For user enrollment, this request returns only certificates pushed by MDM.

    This command doesn't return certificates that Declarative Device Management installs. Instead, use the Declarative Device Management `StatusSecurityCertificateList` status item to monitor the Declarative Device Management certificates.

    Starting with iOS 15.4, this command returns a Not Now response before the passcode-protected device's first unlock after a device boots. Between iOS 15.0 and iOS 15.4, devices in that state didn't respond with Not Now, but the response might not contain all identity certificates.

    Refer to the following sections to determine supported channels and requirements, and to see an example request and response.
