title: Managed Application Configuration Command
description: Get app configurations from managed apps on a device.
payload:
  requesttype: ManagedApplicationConfiguration
  supportedOS:
    iOS:
      introduced: '7.0'
      accessrights: AllowAppInstallation
      supervised: false
      requiresdep: false
      sharedipad:
        mode: allowed
        devicechannel: true
        userchannel: false
      userenrollment:
        mode: allowed
    macOS:
      introduced: '10.15'
      accessrights: AllowAppInstallation
      devicechannel: true
      userchannel: false
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    tvOS:
      introduced: '10.2'
      accessrights: AllowAppInstallation
      supervised: false
    visionOS:
      introduced: '1.1'
      accessrights: AllowAppInstallation
      supervised: false
      requiresdep: false
      userenrollment:
        mode: allowed
    watchOS:
      introduced: '10.0'
      accessrights: AllowAppInstallation
      supervised: false
payloadkeys:
- key: Identifiers
  type: <array>
  presence: required
  content: |-
    The bundle identifiers of the managed apps.

    > Important:
    > For a watchOS app, the identifier needs to be the watch's bundle identifier, which differs from the main bundle identifier for the iPhone to which the watch is paired. Obtain the watch's bundle identifier for an app with a watch bundle, in the `watchBundleId` key that's part of the Content Metadata query. For more information on this query, see `Getting App and Book Information`.
  subkeys:
  - key: IdentifiersItem
    type: <string>
responsekeys:
- key: ApplicationConfigurations
  type: <array>
  presence: required
  content: An array of app configuration items.
  subkeys:
  - key: ApplicationConfigurationsItem
    type: <dictionary>
    content: A dictionary that contains a managed app's configurations item.
    subkeys:
    - key: Identifier
      type: <string>
      presence: required
      content: |-
        The app's bundle identifier.

        > Note:
        > For a watchOS app, the identifier is the watch's bundle identifier, which differs from the main bundle identifier for the iPhone to which the watch is paired.
    - key: Configuration
      type: <dictionary>
      presence: optional
      content: The app's configurations.
      subkeys:
      - key: ANY
        type: <any>
        presence: optional
        content: The app's configuration items.
notes:
- title: ''
  content: |-
    This command allows the server to get the configuration of managed apps.

    The response doesn't include apps that Declarative Device Management is managing.

    Refer to the following sections to determine supported channels and requirements, and to see an example request and response.
