title: Set Recovery Lock Command
description: Set or clear the Recovery Lock password.
payload:
  requesttype: SetRecoveryLock
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '11.5'
      accessrights: DeviceLockAndRemovePasscode
      devicechannel: true
      userchannel: false
      supervised: false
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Sets or clears the recovery lock password (Apple Silicon devices only).
    Requires the "Device lock and passcode removal right".
payloadkeys:
- key: CurrentPassword
  type: <string>
  presence: optional
  content: If the device has a Recovery Lock password set, the system requires the
    current password.
- key: NewPassword
  type: <string>
  presence: required
  content: The new password for Recovery Lock. Set as an empty string to clear the
    Recovery Lock password.
notes:
- title: ''
  content: |-
    This command sets, or clears, a password on booting to recoveryOS. When the device unenrolls MDM the system removes the recovery password.

    This command is only available on a Mac with Apple silicon.
