title: Verify Firmware Password Command
description: Verify the firmware password on a device.
payload:
  requesttype: VerifyFirmwarePassword
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '10.13'
      accessrights: None
      devicechannel: true
      userchannel: false
      supervised: false
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  content: Verifies the device's firmware password. This command is not available
    on a Mac with Apple silicon.
payloadkeys:
- key: Password
  type: <string>
  presence: required
  content: The password to verify.
responsekeys:
- key: VerifyFirmwarePassword
  type: <dictionary>
  presence: required
  content: A dictionary containing the results of the command.
  subkeys:
  - key: PasswordVerified
    type: <boolean>
    presence: required
    content: If 'true', the provided password matched the firmware password set for
      the device.
notes:
- title: ''
  content: |-
    This command has a throttle interval to prevent executing it more frequently than every 30 seconds. Requests that occur within the throttle interval return an error.

    Refer to the following sections to determine supported channels and requirements, and to see an example request and response.

    This command isn't supported on a Mac with Apple silicon.
