<?xml version="1.0" encoding="utf-8"?><!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"><plist version="1.0"><dict>	<key>PayloadDisplayName</key>	<string>SharedSecurity</string>	<key>PayloadIdentifier</key>	<string>com.example.profiles.SharedSecurity</string>		<key>PayloadUUID</key>	<string>E76822B7-5B63-415C-BF84-6095489CD0F1</string>		<key>PayloadScope</key>	<string>System</string>		<key>PayloadDescription</key>	<string></string>		<key>PayloadOrganization</key>	<string>ExampleOrganization</string>		<key>PayloadRemovalDisallowed</key>	<false/>			<key>PayloadVersion</key>	<integer>1</integer>		<key>PayloadType</key>	<string>Configuration</string>	<key>PayloadContent</key>	<array>		<dict>					<key>PayloadType</key>			<string>com.apple.preference.security</string>			<key>PayloadIdentifier</key>			<string>com.example.profiles.SharedSecurity.8BDB2F14-E1C9-413F-BBFC-35C9A2B27996</string>			<key>PayloadUUID</key>			<string>55E089AB-297E-433E-9C8B-1464C71E485F</string>				<key>PayloadVersion</key>			<integer>1</integer>					<key>PayloadEnabled</key>			<true/>			<key>dontAllowLockMessageUI</key>			<true/>						<key>dontAllowPasswordResetUI</key>			<true/>		</dict>			</array></dict></plist>