<?xml version="1.0" encoding="utf-8"?><!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"><plist version="1.0"><dict>	<key>PayloadDisplayName</key>	<string>SharedKioskGlobalPrefs</string>	<key>PayloadIdentifier</key>	<string>com.example.profiles.SharedKioskGlobalPrefs</string>		<key>PayloadUUID</key>	<string>BDA2D8A7-3F92-4349-A76C-1F79D63A340B</string>		<key>PayloadScope</key>	<string>System</string>		<key>PayloadDescription</key>	<string>Sets scroll bar and hides menus bar for kiosk setups</string>		<key>PayloadOrganization</key>	<string>ExampleOrganization</string>		<key>PayloadRemovalDisallowed</key>	<true/>			<key>PayloadVersion</key>	<integer>1</integer>		<key>PayloadType</key>	<string>Configuration</string>	<key>PayloadContent</key>	<array>		<dict>			<key>PayloadType</key>			<string>.GlobalPreferences</string>			<key>PayloadIdentifier</key>			<string>com.example.profiles.SharedKioskGlobalPrefs.89483485-2F5A-4F37-903E-30F84AEB5FBB</string>			<key>PayloadUUID</key>			<string>629AD33E-17F9-475D-9749-74CFC4ADEF20</string>			<key>PayloadVersion</key>			<integer>1</integer>			<key>PayloadEnabled</key>			<true/>						<key>AppleShowScrollBars</key>			<string>WhenScrolling</string>			<key>_HIHideMenuBar</key>			<true/>						<key>CSUIDisable32BitWarning</key>			<true/>		</dict>			</array></dict></plist>