<?xml version="1.0" encoding="UTF-8"?><!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"><plist version="1.0"><dict>	<key>PayloadDisplayName</key>	<string>SharedSafari</string>	<key>PayloadIdentifier</key>	<string>com.example.profiles.SharedSafari</string>	<key>PayloadUUID</key>	<string>2D220C22-645B-4636-AF5F-6DBDF1302A7F</string>	<key>PayloadScope</key>	<string>System</string>	<key>PayloadDescription</key>	<string></string>	<key>PayloadOrganization</key>	<string>ExampleOrganization</string>	<key>PayloadRemovalDisallowed</key>	<false/>	<key>PayloadVersion</key>	<integer>1</integer>	<key>PayloadType</key>	<string>Configuration</string>	<key>PayloadContent</key>	<array>		<dict>					<key>PayloadType</key>			<string>com.apple.Safari</string>			<key>PayloadIdentifier</key>			<string>com.example.profiles.SharedSafari.2E08138C-CD63-473F-B134-9A50D07CF956</string>			<key>PayloadUUID</key>			<string>22580202-2D3F-4158-9158-617793C03341</string>				<key>PayloadVersion</key>			<integer>1</integer>					<key>PayloadEnabled</key>			<true/>						<key>AutoOpenSafeDownloads</key>			<false/>			<key>AlwaysShowFavoritesBarInFullScreen</key>			<false/>			<key>AlwaysShowTabBar</key>			<false/>			<key>AlwaysShowTabBarInFullScreen</key>			<false/>			<key>AutoFillCreditCardData</key>			<false/>			<key>AutoFillFromAddressBook</key>			<false/>			<key>AutoFillMiscellaneousForms</key>			<false/>			<key>AutoFillPasswords</key>			<false/>			<key>BlockStoragePolicy</key>			<integer>1</integer>			<key>DownloadsPath</key>			<string>~/Downloads</string>			<key>DownloadsPathWasConverted</key>			<true/>			<key>CanPromptForPushNotifications</key>			<false/>			<key>EnableEnhancedPrivacyInPrivateBrowsing</key>			<false/>			<key>ExtensionsEnabled</key>			<false/>			<key>HistoryAgeInDaysLimit</key>			<integer>1</integer>			<key>InstallExtensionUpdatesAutomatically</key>			<false/>			<key>LastDisplayedWelcomePageVersionString</key>			<string>4.0</string>			<key>NSToolbar Configuration BrowserToolbarIdentifier-v2</key>			<dict>				<key>TB Display Mode</key>				<integer>2</integer>				<key>TB Icon Size Mode</key>				<integer>1</integer>				<key>TB Is Shown</key>				<integer>1</integer>				<key>TB Size Mode</key>				<integer>1</integer>			</dict>			<key>NSToolbar Configuration BrowserWindowToolbarIdentifier</key>			<dict>				<key>TB Display Mode</key>				<integer>2</integer>				<key>TB Icon Size Mode</key>				<integer>1</integer>				<key>TB Is Shown</key>				<integer>1</integer>				<key>TB Size Mode</key>				<integer>1</integer>			</dict>			<key>NSToolbar Configuration NSPreferences</key>			<dict>				<key>TB Display Mode</key>				<integer>1</integer>				<key>TB Icon Size Mode</key>				<integer>1</integer>				<key>TB Is Shown</key>				<integer>1</integer>				<key>TB Size Mode</key>				<integer>1</integer>			</dict>			<key>NewTabBehavior</key>			<integer>0</integer>			<key>NewWindowBehavior</key>			<integer>0</integer>			<key>OpenPrivateWindowWhenNotRestoringSessionAtLaunch</key>			<true/>			<key>OpenNewTabsInFront</key>			<true/>			<key>PMPrintingExpandedStateForPrint2</key>			<true/>			<key>ProxiesInBookmarksBar</key>			<array>				<string>Top Sites</string>			</array>			<key>RecentWebSearches</key>			<array/>			<key>ResetTopSitesFromClearHistoryPrompt</key>			<true/>			<key>SafariGeolocationPermissionPolicy</key>			<integer>1</integer>			<key>SendDoNotTrackHTTPHeader</key>			<true/>			<key>ShowFavoritesBar-v2</key>			<false/>			<key>ShowSidebarInTopSites</key>			<false/>			<key>ShowStatusBar</key>			<true/>			<key>ShowStatusBarInFullScreen</key>			<true/>			<key>SidebarViewModeIdentifier</key>			<string>Bookmarks</string>			<key>ShowFavoritesBar-v2</key>			<false/>			<key>ShowStatusBar</key>			<false/>			<key>ShowStatusBarInFullScreen</key>			<false/>			<key>SidebarViewModeIdentifier</key>			<string>Bookmarks</string>			<key>UniversalSearchFeatureNotificationHasBeenDisplayed</key>			<true/>																	</dict>				<dict>		     <key>PayloadDescription</key>		     <string>Cross-Site Tracking Prevention Relaxed Domains</string>		     		     <key>PayloadDisplayName</key>		     <string>Cross-Site Tracking Prevention Relaxed Domains</string>		     		     <key>PayloadIdentifier</key>		     <string>com.apple.domains.ACCDBF25-6565-4DA9-A97A-610D2A7FCF29</string>		     		     <key>PayloadType</key>		     <string>com.apple.domains</string>		     		     <key>PayloadUUID</key>		     <string>ACCDBF25-0661-4DA9-A97A-610D2A7FCF29</string>		     		     <key>PayloadVersion</key>		     <integer>1</integer>		     		     <key>CrossSiteTrackingPreventionRelaxedDomains</key>		      		      <array>		        <string>example.com</string>		      </array>		   </dict>	</array></dict></plist>