<?xml version="1.0" encoding="utf-8"?><!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"><plist version="1.0"><dict>	<key>PayloadContent</key>	<array>		<dict>			<key>PayloadType</key>			<string>com.apple.controlcenter</string>			<key>PayloadIdentifier</key>			<string>com.example.profiles.SharedMenuBar.ControlCenter</string>			<key>PayloadUUID</key>			<string>67A8D3DE-5FD7-40AC-9F56-A7333DB12358</string>			<key>PayloadVersion</key>			<integer>1</integer>			<key>UserSwitcher</key>			<integer>0</integer>		</dict>		<dict>			<key>PayloadType</key>			<string>.GlobalPreferences</string>			<key>PayloadIdentifier</key>			<string>com.example.profiles.SharedMenuBar.GlobalPreferences</string>			<key>PayloadUUID</key>			<string>49086BD4-7314-415A-A784-2A94C77B8112</string>			<key>PayloadVersion</key>			<integer>1</integer>			<key>MultipleSessionEnabled</key>			<true/>			<key>userMenuExtraStyle</key>			<integer>0</integer>		</dict>		<dict>					<key>PayloadType</key>			<string>com.apple.systemuiserver</string>			<key>PayloadIdentifier</key>			<string>com.example.profiles.SharedMenuBar.6F1766CA-E22D-4202-AFBF-374C158F5D68</string>			<key>PayloadUUID</key>			<string>20202B34-AD9A-484E-B203-198F4C796C5B</string>			<key>PayloadVersion</key>			<integer>1</integer>			<key>PayloadEnabled</key>			<true/>			<key>NSStatusItem Visible com.apple.menuextra.TimeMachine</key>			<false/>				<key>menuExtras</key>				<array>				<string></string>				</array>							</dict>	</array>	<key>PayloadDescription</key>	<string></string>	<key>PayloadDisplayName</key>	<string>SharedMenuBar</string>	<key>PayloadIdentifier</key>	<string>com.example.profiles.SharedMenuBar</string>	<key>PayloadOrganization</key>	<string>ExampleOrganization</string>	<key>PayloadRemovalDisallowed</key>	<false/>	<key>PayloadScope</key>	<string>System</string>	<key>PayloadType</key>	<string>Configuration</string>	<key>PayloadUUID</key>	<string>63D689F8-9464-456A-8C13-AE285B1A3D5C</string>	<key>PayloadVersion</key>	<integer>1</integer></dict></plist>