<?xml version="1.0"?><!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd"><plist version="1.0"><dict>	<key>PayloadContent</key>	<array>		<dict>			<key>PayloadDisplayName</key>			<string>SharedManagedInstalls</string>			<key>PayloadIdentifier</key>			<string>SharedManagedInstalls</string>			<key>PayloadType</key>			<string>SharedManagedInstalls</string>			<key>PayloadUUID</key>			<string>15BFE994-B3D1-44B2-B0B1-4AADD53053F8</string>			<key>PayloadVersion</key>			<integer>1</integer>			<key>AggressiveUpdateNotificationDays</key>			<integer>7</integer>			<key>InstallAppleSoftwareUpdates</key>			<false/>			<key>ShowOptionalInstallsForHigherOSVersions</key>			<true/>			<key>SuppressAutoInstall</key>			<false/>			<key>SuppressLoginwindowInstall</key>			<false/>			<key>SuppressUserNotification</key>			<false/>		</dict>	</array>	<key>PayloadDisplayName</key>	<string>SharedManagedInstalls</string>	<key>PayloadIdentifier</key>	<string>com.example.profiles.SharedManagedInstalls</string>	<key>PayloadOrganization</key>	<string>ExampleOrganization</string>	<key>PayloadRemovalDisallowed</key>	<false/>	<key>PayloadScope</key>	<string>System</string>	<key>PayloadType</key>	<string>Configuration</string>	<key>PayloadUUID</key>	<string>CD463A01-321F-40E9-8C7F-0102927E09FA</string>	<key>PayloadVersion</key>	<integer>1</integer>	<key>TargetDeviceType</key>	<integer>5</integer></dict></plist>