title: Status MDM App
description: A status report of the client's MDM-installed apps.
payload:
  statusitemtype: mdm.app
  supportedOS:
    iOS:
      introduced: '16.0'
      allowed-enrollments:
      - supervised
      - device
      - user
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
        - user
    macOS:
      introduced: n/a
    tvOS:
      introduced: '16.0'
      allowed-enrollments:
      - supervised
      - device
      allowed-scopes:
      - system
    visionOS:
      introduced: '1.1'
      allowed-enrollments:
      - supervised
      - device
      - user
      allowed-scopes:
      - system
    watchOS:
      introduced: '10.0'
      allowed-enrollments:
      - supervised
      allowed-scopes:
      - system
payloadkeys:
- key: mdm.app
  title: Status item value.
  type: <array>
  presence: required
  content: The list of apps. The response doesn't include apps that are managed by
    Declarative Device Management.
  subkeytype: App
  subkeys:
  - key: status_value
    type: <dictionary>
    content: A status report that contains details about an MDM-installed app.
    subkeys:
    - key: identifier
      title: Unique identifier of the app.
      type: <string>
      presence: required
      content: The app's bundle id, which is unique.
    - key: _removed
      title: Indicates removal of the app.
      type: <boolean>
      presence: optional
      default: false
      content: If `true`, the system removed the app and only this key and the `identifier`
        key are present in the status item object. The device reports an MDM-installed
        app as removed if management of the app has been transferred to Declarative
        Device Management.
    - key: name
      title: App name
      type: <string>
      presence: optional
      content: The name of the app.
    - key: external-version-id
      title: External version identifier
      type: <string>
      presence: optional
      content: |-
        The app's external version identifier. You can also retrieve this value from the App Store. For more information, see `Apps and Books for Organizations`.

        If the current external version identifier of an app on the App Store doesn't match the external version identifier reported by the device, there may be an app update available for the device.
    - key: version
      title: Version
      type: <string>
      presence: optional
      content: The version of the app.
    - key: short-version
      title: Short version
      type: <string>
      presence: optional
      content: The short version of the app.
    - key: state
      title: Managed application list status
      type: <string>
      presence: optional
      rangelist:
      - queued
      - needs-redemption
      - redeeming
      - prompting
      - prompting-for-login
      - validating-purchase
      - prompting-for-update
      - prompting-for-update-login
      - prompting-for-management
      - validating-update
      - updating
      - installing
      - managed
      - managed-but-uninstalled
      - unknown
      - user-installed-app
      - user-rejected
      - update-rejected
      - management-rejected
      - failed
      content: The status of the app that `ManagedApplicationListCommand` reports.
