title: Status Software Update Pending Version
description: A status report of the pending software update version.
payload:
  statusitemtype: softwareupdate.pending-version
  supportedOS:
    iOS:
      introduced: '17.0'
      allowed-enrollments:
      - supervised
      - device
      allowed-scopes:
      - system
      sharedipad:
        allowed-scopes:
        - system
    macOS:
      introduced: '14.0'
      allowed-enrollments:
      - supervised
      allowed-scopes:
      - system
    tvOS:
      introduced: '18.4'
      allowed-enrollments:
      - supervised
      - device
      allowed-scopes:
      - system
    visionOS:
      introduced: '26.0'
      allowed-enrollments:
      - supervised
      - device
      allowed-scopes:
      - system
    watchOS:
      introduced: n/a
payloadkeys:
- key: softwareupdate.pending-version
  title: Pending software update version.
  type: <dictionary>
  presence: required
  content: A dictionary that contains the build and OS versions of the software update
    that's pending on the device.
  subkeytype: Dictionary
  subkeys:
  - key: os-version
    title: The OS version
    type: <string>
    presence: required
    content: The OS version of the pending software update, including any Background
      Security Improvement version. This string is empty if no update is pending.
  - key: build-version
    title: The build version
    type: <string>
    presence: required
    content: The build version of the pending software update, including any Background
      Security Improvement version. This string is empty if no update is pending.
  - key: target-local-date-time
    title: The target local date-time
    type: <string>
    presence: optional
    content: The local date time value that indicates when the pending software update
      will be installed. This key is only present when the pending software update
      is being enforced.
