title: Get Bootstrap Token
description: Gets the bootstrap token from the server.
payload:
  requesttype: GetBootstrapToken
  supportedOS:
    iOS:
      introduced: '26.0'
      supervised: true
      requiresdep: true
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.15'
      devicechannel: true
      userchannel: false
      supervised: true
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '26.0'
      supervised: true
      requiresdep: true
      userenrollment:
        mode: forbidden
    watchOS:
      introduced: n/a
  content: Check-in protocol get bootstrap token data request and response.
payloadkeys:
- key: MessageType
  type: <string>
  presence: required
  rangelist:
  - GetBootstrapToken
  content: The message type, which requires a value of `GetBootstrapToken`.
- key: AwaitingConfiguration
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, the device is awaiting a `Device-Configured-Command` command
    before proceeding through Setup Assistant.
responsekeys:
- key: BootstrapToken
  type: <data>
  presence: optional
  content: The current bootstrap token data for the device.
notes:
- title: ''
  content: |-
    A server that supports this request needs to include a `com.apple.mdm.bootstraptoken` value in the `ServerCapabilities` key of the MDM profile payload to enroll the device.

    This request returns the device's bootstrap token data that the server stores.

    If a bootstrap token isn't available, the server returns a success response with either a zero-length value for the `BootstrapToken` key or omits the key.

    Requires a device enrolled using Automated Device Enrollment.
