title: Set Bootstrap Token
description: Sends the bootstrap token to the server.
payload:
  requesttype: SetBootstrapToken
  supportedOS:
    iOS:
      introduced: '26.0'
      supervised: true
      requiresdep: true
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '10.15'
      devicechannel: true
      userchannel: false
      supervised: true
      requiresdep: false
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: n/a
    visionOS:
      introduced: '26.0'
      supervised: true
      requiresdep: true
      userenrollment:
        mode: forbidden
    watchOS:
      introduced: n/a
  content: Check-in protocol set bootstrap token data request and response.
payloadkeys:
- key: MessageType
  type: <string>
  presence: required
  rangelist:
  - SetBootstrapToken
  content: The message type, which requires a value of `SetBootstrapToken`.
- key: BootstrapToken
  type: <data>
  presence: optional
  content: The device's bootstrap token data. If this field is missing or zero length,
    the server needs to remove the bootstrap token for this device.
- key: AwaitingConfiguration
  type: <boolean>
  presence: optional
  default: false
  content: If `true`, the device is awaiting a `Device-Configured-Command` command
    before proceeding through Setup Assistant.
notes:
- title: ''
  content: |-
    A server that supports this request needs to include a `com.apple.mdm.bootstraptoken` value in the `ServerCapabilities` key of the MDM profile payload to enroll the device.

    This request changes or clears a device's bootstrap token data that the server stores.

    Requires a device enrolled using Automated Device Enrollment.
