title: MachineInfo
description: A device's information in response to a MDM enrollment profile request.
payload:
  payloadtype: MachineInfo
  supportedOS:
    iOS:
      introduced: '7.0'
    macOS:
      introduced: '10.9'
    tvOS:
      introduced: '10.2'
    visionOS:
      introduced: '1.1'
    watchOS:
      introduced: '10.0'
payloadkeys:
- key: UDID
  title: UDID
  supportedOS:
    iOS:
      userenrollment:
        mode: forbidden
    macOS:
      userenrollment:
        mode: forbidden
    tvOS:
      userenrollment:
        mode: forbidden
    visionOS:
      userenrollment:
        mode: forbidden
  type: <string>
  presence: required
  content: The device's UDID.
- key: SERIAL
  title: Serial Number
  supportedOS:
    iOS:
      userenrollment:
        mode: forbidden
    macOS:
      userenrollment:
        mode: forbidden
    tvOS:
      userenrollment:
        mode: forbidden
    visionOS:
      userenrollment:
        mode: forbidden
  type: <string>
  presence: required
  content: The device's serial number.
- key: PRODUCT
  title: Product
  type: <string>
  presence: required
  content: The device's product type, for example, `iPhone5,1`.
- key: VERSION
  title: Build Version
  type: <string>
  presence: required
  content: The build version installed on the device, for example, `7A182`.
- key: OS_VERSION
  title: OS Version
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
  type: <string>
  presence: required
  content: |-
    The OS version installed on the device, for example, 17.0.

    Available on iOS 17 and later, macOS 14 and later, tvOS 17 and later, and watchOS 10 and later.
- key: SUPPLEMENTAL_BUILD_VERSION
  title: Supplemental Build Version
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
  type: <string>
  presence: optional
  content: |-
    The device's operating system supplemental build version (if available).

    Available on iOS 17 and later, macOS 14 and later, tvOS 17 and later, and watchOS 10 and later.
- key: SUPPLEMENTAL_OS_VERSION_EXTRA
  title: Supplemental OS Version Extra
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: '17.0'
  type: <string>
  presence: optional
  content: |-
    The device's operating system supplemental OS version extra (if available).

    Available on iOS 17 and later, macOS 14 and later, tvOS 17 and later, and watchOS 10 and later.
- key: IMEI
  title: IMEI
  supportedOS:
    iOS:
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The device's IMEI (if available).
- key: MEID
  title: MEID
  supportedOS:
    iOS:
      userenrollment:
        mode: forbidden
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The device's MEID (if available).
- key: LANGUAGE
  title: Language
  type: <string>
  presence: optional
  content: The user's currently-selected language, for example, `en`.
- key: MDM_CAN_REQUEST_SOFTWARE_UPDATE
  title: MDM Can Request Software Update
  supportedOS:
    iOS:
      introduced: '17.0'
    macOS:
      introduced: '14.0'
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: |-
    If `true`, indicates that the server can trigger the device to do a required software update.

    Available on iOS 17 and later, and macOS 14 and later.
- key: PAIRING_TOKEN
  title: Watch Enrollment Pairing Token
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
  type: <data>
  presence: optional
  content: |-
    The pairing token to validate when a watch is enrolling.

    Available on watchOS 10 and later.
- key: SOFTWARE_UPDATE_DEVICE_ID
  title: Software Update Device ID
  supportedOS:
    iOS:
      introduced: '17.4'
    macOS:
      introduced: '14.4'
    tvOS:
      introduced: n/a
  type: <string>
  presence: optional
  content: The device model identifier used to lookup available OS updates through
    https://gdmf.apple.com/v2/pmv. Available on iOS 17.4 and later, macOS 14.4 and
    later, and visionOS 1.1 and later.
- key: MDM_CAN_REQUEST_PSSO_CONFIG
  title: Platform SSO is Supported
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '26.0'
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: |-
    If `true`, indicates that the server can trigger the device to do a required Platform SSO authentication before enrolling.

    Available on macOS 26 and later.
- key: MANDATORY_SOFTWARE_UPDATE_REQUIRED
  title: Mandatory software update is required
  supportedOS:
    iOS:
      introduced: n/a
    macOS:
      introduced: '26.1'
    tvOS:
      introduced: n/a
    visionOS:
      introduced: n/a
    watchOS:
      introduced: n/a
  type: <boolean>
  presence: optional
  default: false
  content: |-
    If `true`, indicates that the device requires a mandatory software update during Setup Assistant. The MDM server can return a 403 with a `ErrorCodeSoftwareUpdateRequired` error to force the device to update to a specific version instead of the device choosing a version.

    Available on macOS 26.1 and later.
notes:
- title: ''
  content: This dictionary is CMS-signed with the device identity certificate. The
    system includes the device's certificate and all necessary intermediate certificates.
    The certificate chain should validate against the Apple Root CA.
